RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_rtcb.h
/**
  *******************************************************************************************************
  * @file    fm33lg0xx_fl_rtcb.h
  * @author  FMSH Application Team
  * @brief   Head file of RTCB FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LG0XX_FL_RTCB_H
#define __FM33LG0XX_FL_RTCB_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lg0xx_fl_def.h"
/** @addtogroup FM33LG0XX_FL_Driver
  * @{
  */

/** @defgroup RTCB RTCB
  * @brief RTCB FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RTCB_FL_ES_INIT RTCB Exported Init structures
  * @{
  */

/**
  * @brief Configuration with temporary structure variable users will not be used directly
  */
typedef __IO struct
{
    __IO uint32_t backup[5];
} FL_RTCB_Backup_ADDR;
/**
  * @brief FL RTCB Init Sturcture definition
  */
typedef struct
{
    /** 年 */
    uint32_t year;
    /** 月 */
    uint32_t month;
    /** 日 */
    uint32_t day;
    /** 周 */
    uint32_t week;
    /** 时 */
    uint32_t hour;
    /** 分 */
    uint32_t minute;
    /** 秒 */
    uint32_t second;

} FL_RTCB_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RTCB_FL_Exported_Constants RTCB Exported Constants
  * @{
  */

#define    RTCB_IER_STP_IE_Pos                                    (13U)
#define    RTCB_IER_STP_IE_Msk                                    (0x1U << RTCB_IER_STP_IE_Pos)
#define    RTCB_IER_STP_IE                                        RTCB_IER_STP_IE_Msk

#define    RTCB_IER_ADJ_IE_Pos                                    (12U)
#define    RTCB_IER_ADJ_IE_Msk                                    (0x1U << RTCB_IER_ADJ_IE_Pos)
#define    RTCB_IER_ADJ_IE                                        RTCB_IER_ADJ_IE_Msk

#define    RTCB_IER_SEC_IE_Pos                                    (3U)
#define    RTCB_IER_SEC_IE_Msk                                    (0x1U << RTCB_IER_SEC_IE_Pos)
#define    RTCB_IER_SEC_IE                                        RTCB_IER_SEC_IE_Msk

#define    RTCB_IER_MIN_IE_Pos                                    (2U)
#define    RTCB_IER_MIN_IE_Msk                                    (0x1U << RTCB_IER_MIN_IE_Pos)
#define    RTCB_IER_MIN_IE                                        RTCB_IER_MIN_IE_Msk

#define    RTCB_IER_HOUR_IE_Pos                                   (1U)
#define    RTCB_IER_HOUR_IE_Msk                                   (0x1U << RTCB_IER_HOUR_IE_Pos)
#define    RTCB_IER_HOUR_IE                                       RTCB_IER_HOUR_IE_Msk

#define    RTCB_IER_DAY_IE_Pos                                    (0U)
#define    RTCB_IER_DAY_IE_Msk                                    (0x1U << RTCB_IER_DAY_IE_Pos)
#define    RTCB_IER_DAY_IE                                        RTCB_IER_DAY_IE_Msk

#define    RTCB_ISR_STP_IF_Pos                                    (13U)
#define    RTCB_ISR_STP_IF_Msk                                    (0x1U << RTCB_ISR_STP_IF_Pos)
#define    RTCB_ISR_STP_IF                                        RTCB_ISR_STP_IF_Msk

#define    RTCB_ISR_ADJ_IF_Pos                                    (12U)
#define    RTCB_ISR_ADJ_IF_Msk                                    (0x1U << RTCB_ISR_ADJ_IF_Pos)
#define    RTCB_ISR_ADJ_IF                                        RTCB_ISR_ADJ_IF_Msk

#define    RTCB_ISR_SEC_IF_Pos                                    (3U)
#define    RTCB_ISR_SEC_IF_Msk                                    (0x1U << RTCB_ISR_SEC_IF_Pos)
#define    RTCB_ISR_SEC_IF                                        RTCB_ISR_SEC_IF_Msk

#define    RTCB_ISR_MIN_IF_Pos                                    (2U)
#define    RTCB_ISR_MIN_IF_Msk                                    (0x1U << RTCB_ISR_MIN_IF_Pos)
#define    RTCB_ISR_MIN_IF                                        RTCB_ISR_MIN_IF_Msk

#define    RTCB_ISR_HOUR_IF_Pos                                   (1U)
#define    RTCB_ISR_HOUR_IF_Msk                                   (0x1U << RTCB_ISR_HOUR_IF_Pos)
#define    RTCB_ISR_HOUR_IF                                       RTCB_ISR_HOUR_IF_Msk

#define    RTCB_ISR_DAY_IF_Pos                                    (0U)
#define    RTCB_ISR_DAY_IF_Msk                                    (0x1U << RTCB_ISR_DAY_IF_Pos)
#define    RTCB_ISR_DAY_IF                                        RTCB_ISR_DAY_IF_Msk

#define    RTCB_TMSEL_TMSEL_Pos                                   (0U)
#define    RTCB_TMSEL_TMSEL_Msk                                   (0xfU << RTCB_TMSEL_TMSEL_Pos)
#define    RTCB_TMSEL_TMSEL                                       RTCB_TMSEL_TMSEL_Msk

#define    RTCB_ADJR_ADSIGN_Pos                                   (9U)
#define    RTCB_ADJR_ADSIGN_Msk                                   (0x1U << RTCB_ADJR_ADSIGN_Pos)
#define    RTCB_ADJR_ADSIGN                                       RTCB_ADJR_ADSIGN_Msk

#define    RTCB_CR_EN_Pos                                         (0U)
#define    RTCB_CR_EN_Msk                                         (0x1U << RTCB_CR_EN_Pos)
#define    RTCB_CR_EN                                             RTCB_CR_EN_Msk

