RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_rtcb.h
/**
  * @brief    Get RTCB Time Stamp Edge
  * @rmtoll   STPCR    TSEDGE    FL_RTCB_GetTimeStampEdge
  * @param    RTCBx RTCB instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_RTCB_TIMESTAMP_EDGE_RISING
  *           @arg @ref FL_RTCB_TIMESTAMP_EDGE_FALLING
  */
__STATIC_INLINE uint32_t FL_RTCB_GetTimeStampEdge(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCR, RTCB_STPCR_TSEDGE_Msk));
}

/**
  * @brief    RTCB Tamper enable
  * @rmtoll   STPCR    TAMPEN    FL_RTCB_EnableTamper
  * @param    RTCBx RTCB instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_EnableTamper(RTCB_Type *RTCBx)
{
    SET_BIT(RTCBx->STPCR, RTCB_STPCR_TAMPEN_Msk);
}

/**
  * @brief    Get RTCB Tamper enable  status
  * @rmtoll   STPCR    TAMPEN    FL_RTCB_IsEnabledTamper
  * @param    RTCBx RTCB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCB_IsEnabledTamper(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCR, RTCB_STPCR_TAMPEN_Msk) == RTCB_STPCR_TAMPEN_Msk);
}

/**
  * @brief    RTCB Tamper Disable
  * @rmtoll   STPCR    TAMPEN    FL_RTCB_DisableTamper
  * @param    RTCBx RTCB instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_DisableTamper(RTCB_Type *RTCBx)
{
    CLEAR_BIT(RTCBx->STPCR, RTCB_STPCR_TAMPEN_Msk);
}

/**
  * @brief    RTCB Time Stamp enable
  * @rmtoll   STPCR    TSEN    FL_RTCB_EnableTimestamp
  * @param    RTCBx RTCB instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_EnableTimestamp(RTCB_Type *RTCBx)
{
    SET_BIT(RTCBx->STPCR, RTCB_STPCR_TSEN_Msk);
}

/**
  * @brief    Get RTCB Time Stamp enable  status
  * @rmtoll   STPCR    TSEN    FL_RTCB_IsEnabledTimestamp
  * @param    RTCBx RTCB instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTCB_IsEnabledTimestamp(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCR, RTCB_STPCR_TSEN_Msk) == RTCB_STPCR_TSEN_Msk);
}

/**
  * @brief    RTCB Time Stamp Disable
  * @rmtoll   STPCR    TSEN    FL_RTCB_DisableTimestamp
  * @param    RTCBx RTCB instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_DisableTimestamp(RTCB_Type *RTCBx)
{
    CLEAR_BIT(RTCBx->STPCR, RTCB_STPCR_TSEN_Msk);
}

/**
  * @brief    Get RTCB Stamp Hour Value
  * @rmtoll   STPCLKRR        FL_RTCB_ReadTimestampHour
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampHour(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCLKRR, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    Set RTCB Stamp Hour Value
  * @rmtoll   STPCLKRR        FL_RTCB_WriteTimestampHour
  * @param    RTCBx RTCB instance
  * @param    hour
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampHour(RTCB_Type *RTCBx, uint32_t hour)
{
    MODIFY_REG(RTCBx->STPCLKRR, (0x3fU << 16U), (hour << 16U));
}

/**
  * @brief    Get RTCB Stamp Minute Value
  * @rmtoll   STPCLKRR        FL_RTCB_ReadTimestampMinute
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampMinute(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCLKRR, (0x7fU << 8U)) >> 8U);
}

/**
  * @brief    Set RTCB Stamp Minute Value
  * @rmtoll   STPCLKRR        FL_RTCB_WriteTimestampMinute
  * @param    RTCBx RTCB instance
  * @param    minute
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampMinute(RTCB_Type *RTCBx, uint32_t minute)
{
    MODIFY_REG(RTCBx->STPCLKRR, (0x7fU << 8U), (minute << 8U));
}

/**
  * @brief    Get RTCB Stamp Second Value
  * @rmtoll   STPCLKRR        FL_RTCB_ReadTimestampSecond
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampSecond(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCLKRR, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCB Stamp Second Value
  * @rmtoll   STPCLKRR        FL_RTCB_WriteTimestampSecond
  * @param    RTCBx RTCB instance
  * @param    second
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampSecond(RTCB_Type *RTCBx, uint32_t second)
{
    MODIFY_REG(RTCBx->STPCLKRR, (0x7fU << 0U), (second << 0U));
}

/**
  * @brief    Get RTCB Stamp Year Value
  * @rmtoll   STPCALRR        FL_RTCB_ReadTimestampYear
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampYear(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCALRR, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Set RTCB Stamp Year Value
  * @rmtoll   STPCALRR        FL_RTCB_WriteTimestampYear
  * @param    RTCBx RTCB instance
  * @param    year
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampYear(RTCB_Type *RTCBx, uint32_t year)
{
    MODIFY_REG(RTCBx->STPCALRR, (0xffU << 24U), (year << 24U));
}

/**
  * @brief    Get RTCB Stamp Month Value
  * @rmtoll   STPCALRR        FL_RTCB_ReadTimestampMonth
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampMonth(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCALRR, (0x1fU << 16U)) >> 16U);
}

/**
  * @brief    Set RTCB Stamp Month Value
  * @rmtoll   STPCALRR        FL_RTCB_WriteTimestampMonth
  * @param    RTCBx RTCB instance
  * @param    month
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampMonth(RTCB_Type *RTCBx, uint32_t month)
{
    MODIFY_REG(RTCBx->STPCALRR, (0x1fU << 16U), (month << 16U));
}

/**
  * @brief    Get RTCB Stamp Day Value
  * @rmtoll   STPCALRR        FL_RTCB_ReadTimestampDay
  * @param    RTCBx RTCB instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadTimestampDay(RTCB_Type *RTCBx)
{
    return (uint32_t)(READ_BIT(RTCBx->STPCALRR, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Set RTCB Stamp Day Value
  * @rmtoll   STPCALRR        FL_RTCB_WriteTimestampDay
  * @param    RTCBx RTCB instance
  * @param    day
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteTimestampDay(RTCB_Type *RTCBx, uint32_t day)
{
    MODIFY_REG(RTCBx->STPCALRR, (0x3fU << 0U), (day << 0U));
}

/**
  * @brief    Get RTCB Backup Register
  * @rmtoll   BACKUP        FL_RTCB_ReadBackupRegisters
  * @param    RTCBx RTCB instance
  * @param    backupRegNum This parameter can be one of the following values:
  *           @arg @ref FL_RTCB_BACKUP_0
  *           @arg @ref FL_RTCB_BACKUP_1
  *           @arg @ref FL_RTCB_BACKUP_2
  *           @arg @ref FL_RTCB_BACKUP_3
  *           @arg @ref FL_RTCB_BACKUP_4
  * @retval
  */
__STATIC_INLINE uint32_t FL_RTCB_ReadBackupRegisters(RTCB_Type *RTCBx, uint32_t backupRegNum)
{
    FL_RTCB_Backup_ADDR  *addr = (FL_RTCB_Backup_ADDR *)&RTCBx->BKR0;
    return (uint32_t)(READ_BIT(addr->backup[backupRegNum], 0xFFFFFFFFu));
}

/**
  * @brief    Set RTCB Backup Register
  * @rmtoll   BACKUP        FL_RTCB_WriteBackupRegisters
  * @param    RTCBx RTCB instance
  * @param    backupReg
  * @param    backupNum
  * @retval   None
  */
__STATIC_INLINE void FL_RTCB_WriteBackupRegisters(RTCB_Type *RTCBx, uint32_t backupReg, uint32_t backupNum)
{
    FL_RTCB_Backup_ADDR  *addr = (FL_RTCB_Backup_ADDR *)&RTCBx->BKR0;
    MODIFY_REG(addr->backup[backupNum], (0xFFFFFFFFu), backupReg);
}

/**
  * @}
  */

/** @defgroup RTCB_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_RTCB_DeInit(RTCB_Type *RTCBx);
void FL_RTCB_StructInit(FL_RTCB_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCB_GetTime(RTCB_Type *RTCBx, FL_RTCB_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCB_Init(RTCB_Type *RTCBx, FL_RTCB_InitTypeDef *initStruct);
FL_ErrorStatus FL_RTCB_ConfigTime(RTCB_Type *RTCBx, FL_RTCB_InitTypeDef *initStruct);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LG0XX_FL_RTCB_H*/

/*************************Py_Code_Generator Version: 0.1-0.11-0.1 @ 2020-09-14*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
